# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLOv6n with LERFBlock (Large Effective Receptive Field Block)
# Based on YOLOv6 architecture with LERFBlock integration for enhanced receptive field

# Parameters
nc: 80 # number of classes
activation: torch.nn.ReLU() # (optional) model default activation function
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# YOLOv6 backbone with LERFBlock
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  
  # === 关键修改: 使用 LERFBlock 替代 Conv 重复层 ===
  # Stage 1: 使用 31x31 大核增强感受野
  - [-1, 1, LERFBlock, [128, 31]] # 2 (替代 6xConv)
  
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  
  # Stage 2: 使用 29x29 大核
  - [-1, 1, LERFBlock, [256, 29]] # 4 (替代 12xConv)
  
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  
  # Stage 3: 使用 27x27 大核
  - [-1, 1, LERFBlock, [512, 27]] # 6 (替代 18xConv)
  
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  
  # Stage 4: 使用 13x13 大核
  - [-1, 1, LERFBlock, [1024, 13]] # 8 (替代 6xConv)
  
  - [-1, 1, SPPF, [1024, 5]] # 9

# YOLOv6 head (保持原始结构)
head:
  - [-1, 1, Conv, [256, 1, 1]]
  - [-1, 1, nn.ConvTranspose2d, [256, 2, 2, 0]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 1, Conv, [256, 3, 1]]
  - [-1, 9, Conv, [256, 3, 1]] # 14

  - [-1, 1, Conv, [128, 1, 1]]
  - [-1, 1, nn.ConvTranspose2d, [128, 2, 2, 0]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 1, Conv, [128, 3, 1]]
  - [-1, 9, Conv, [128, 3, 1]] # 19

  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 15], 1, Concat, [1]] # cat head P4
  - [-1, 1, Conv, [256, 3, 1]]
  - [-1, 9, Conv, [256, 3, 1]] # 23

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] # cat head P5
  - [-1, 1, Conv, [512, 3, 1]]
  - [-1, 9, Conv, [512, 3, 1]] # 27

  - [[19, 23, 27], 1, Detect, [nc]] # Detect(P3, P4, P5)
