# Ultralytics YOLO11-P2-DWS-Mixed (HASA-Net v2)
# Strategy: Mixed Upsampling
# 1. Deep Layers (P5->P4, P4->P3): Use DySample for semantic alignment.
# 2. Shallow Layer (P3->P2): Use Nearest Upsample to preserve weak raw signals.

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO11n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] # 2
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 4
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C2f, [512, True]] # 6
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C2f, [1024, True]] # 8
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

# YOLO11n head
head:
  # P5 -> P4 (Deep feature alignment -> Use DySample)
  - [-1, 1, DySample, [1024, 2, 'lp']] # 11
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, C2f, [512, False]] # 13

  # P4 -> P3 (Mid feature alignment -> Use DySample)
  - [-1, 1, DySample, [512, 2, 'lp']] # 14
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, C2f, [256, False]] # 16 (P3/8)

  # P3 -> P2 (Raw signal preservation -> Use Nearest Upsample)
  # DySample removed here to avoid destroying small object details
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 17
  - [[-1, 2], 1, Concat, [1]] # cat backbone P2
  - [-1, 2, C2f, [128, False]] # 19 (P2/4)

  # P2 -> P3
  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 16], 1, Concat, [1]] # cat head P3
  - [-1, 2, C2f, [256, False]] # 22 (P3/8)

  # P3 -> P4
  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]] # cat head P4
  - [-1, 2, C2f, [512, False]] # 25 (P4/16)

  # P4 -> P5
  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] # cat head P5
  - [-1, 2, C2f, [1024, True]] # 28 (P5/32)

  # Detect
  - [[19, 22, 25, 28], 1, Detect, [nc]] # Detect(P2, P3, P4, P5)
