# EDGS-YOLOv8n (YOLO11n-based) configuration
# Optimized for Small UAV Detection
# IMPROVEMENTS:
# - Backbone: P2 high-res feature extraction.
# - Neck: Ghost modules (lightweight), EMA attention, P5 removed (no large object detect).
# - Head: Detect on P2, P3, P4. DCNv2 for deformation handling.

# Parameters
nc: 1  # number of classes (Drone)
scales: 
  n: [0.50, 0.25, 1024] 

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4  <-- High res feature
  - [-1, 2, C3k2, [256, False, 0.25]] # 2
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 4
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]] # 6
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]] # 8
  - [-1, 1, SPPF, [1024, 5]]  # 9

head:
  # Neck - Upsampling and Fusion
  
  # --- Dealing with P4 (Medium/Large) ---
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 3, C3Ghost, [512]]   # 12 (Replaced C3k2 with C3Ghost)
  - [-1, 1, EMA, [512]]       # 13 (Added EMA)

  # --- Dealing with P3 (Small/Medium) ---
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, C3Ghost, [256]]   # 16 (Replaced C3k2 with C3Ghost)
  - [-1, 1, EMA, [256]]       # 17 (Added EMA)

  # --- Dealing with P2 (Very Small) - New Layer ---
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 2], 1, Concat, [1]] # cat backbone P2 (High Resolution)
  - [-1, 3, C3Ghost, [128]]   # 20 (Processing P2)
  - [-1, 1, EMA, [128]]       # 21

  # --- Downsampling Path (Neck) ---
  - [-1, 1, GhostConv, [128, 3, 2]] # 22 (Downsample)
  - [[-1, 17], 1, Concat, [1]]      # cat P3
  - [-1, 3, C3Ghost, [256]]         # 24

  - [-1, 1, GhostConv, [256, 3, 2]] # 25 (Downsample)
  - [[-1, 13], 1, Concat, [1]]      # cat P4
  - [-1, 3, C3Ghost, [512]]         # 27
  
  # --- DDetect Enhancement (DCNv2) ---
  - [21, 1, DCNv2, [128]] # 28 (Input for P2 Detect)
  - [24, 1, DCNv2, [256]] # 29 (Input for P3 Detect)
  - [27, 1, DCNv2, [512]] # 30 (Input for P4 Detect)

  # --- Detection Head ---
  # Detects on P2 (28), P3 (29), P4 (30)
  - [[28, 29, 30], 1, Detect, [nc]] 
