# Ultralytics YOLO11n-LERF
# 专为无人机检测定制
# 核心改变： Backbone 使用 LERFBlock，大核尺寸分别为 [31, 29, 27, 13]

# Parameters
nc: 1 # 只有一类: Drone
scales: 
  n: [0.50, 0.25, 1024] 

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  
  # Stage 1: 使用 31x31 大核
  - [-1, 1, LERFBlock, [128, 31]] # 2 (Replacing C3k2)
  
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  
  # Stage 2: 使用 29x29 大核
  - [-1, 1, LERFBlock, [256, 29]] # 4
  
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  
  # Stage 3: 使用 27x27 大核
  - [-1, 1, LERFBlock, [512, 27]] # 6
  
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  
  # Stage 4: 使用 13x13 大核
  - [-1, 1, LERFBlock, [1024, 13]] # 8
  
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 1, C2PSA, [1024]] # 10

# Head (保持 YOLO11 原生设计以利用其优秀的检测头)
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 3, C3k2, [512, False]] # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, C3k2, [256, False]] # 16 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]] # cat head P4
  - [-1, 3, C3k2, [512, False]] # 19 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] # cat head P5
  - [-1, 3, C3k2, [1024, True]] # 22 (P5/32-large)

  - [[16, 19, 22], 1, Detect, [nc]] 
