# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license
task: detect

# YOLO11n + SimAM(FMM) before Detect (P3,P4,P5)

nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]       # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]      # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]      # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]      # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]     # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]        # 9
  - [-1, 2, C2PSA, [1024]]          # 10

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 11
  - [[-1, 6], 1, Concat, [1]]                   # 12 cat backbone P4
  - [-1, 2, C3k2, [512, False]]                 # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 14
  - [[-1, 4], 1, Concat, [1]]                   # 15 cat backbone P3
  - [-1, 2, C3k2, [256, False]]                 # 16 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]                  # 17
  - [[-1, 13], 1, Concat, [1]]                  # 18 cat head P4
  - [-1, 2, C3k2, [512, False]]                 # 19 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]                  # 20
  - [[-1, 10], 1, Concat, [1]]                  # 21 cat head P5
  - [-1, 2, C3k2, [1024, True]]                 # 22 (P5/32-large)

  # --- SimAM(FMM) inserted here: parameter-free, channel-wise statistics reweighting ---
  - [16, 1, SimAM, [256, 1.0e-4]]   # P3 has 256 channels
  - [19, 1, SimAM, [512, 1.0e-4]]   # P4 has 512 channels
  - [22, 1, SimAM, [1024, 1.0e-4]]  # P5 has 1024 channels

  - [[23, 24, 25], 1, Detect, [nc]]
