# Ultralytics YOLO11-Hasa
# HASA (Hybrid Adaptive Spatial Attention) 增强模型
# 使用C2f_HASA替换所有C2f模块,集成多尺度特征融合和混合注意力机制

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants
  n: [0.50, 0.25, 1024]

# YOLO11n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] # 2
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 4
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C2f_HASA, [512, True]] # 6 (HASA增强)
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C2f_HASA, [1024, True]] # 8 (HASA增强)
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

# YOLO11n-Hasa head
head:
  # P5 -> P4
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, C2f_HASA, [512, False]] # 13 (HASA增强)

  # P4 -> P3
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, C2f_HASA, [256, False]] # 16 (P3/8) (HASA增强)

  # P3 -> P2 (P2 Head Path)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 2], 1, Concat, [1]] # cat backbone P2
  - [-1, 2, C2f_HASA, [128, False]] # 19 (P2/4) (HASA增强)

  # P2 -> P3
  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 16], 1, Concat, [1]] # cat head P3
  - [-1, 2, C2f_HASA, [256, False]] # 22 (P3/8) (HASA增强)

  # P3 -> P4
  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]] # cat head P4
  - [-1, 2, C2f_HASA, [512, False]] # 25 (P4/16) (HASA增强)

  # P4 -> P5
  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] # cat head P5
  - [-1, 2, C2f_HASA, [1024, True]] # 28 (P5/32) (HASA增强)

  # Detect
  - [[19, 22, 25, 28], 1, Detect, [nc]] # Detect(P2, P3, P4, P5)
