# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLOv5n with LGFFM (Local-Global Feature Fusion Module)
# Based on YOLOv5 architecture with LGFFM integration in backbone

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 1024]
  l: [1.00, 1.00, 1024]
  x: [1.33, 1.25, 1024]

# YOLOv5 backbone with LGFFM
backbone:
  # [from, number, module, args]
  # === 关键修改: 使用 LGFFM 替代第一个 Conv ===
  # LGFFM 用于增强局部-全局特征融合
  - [-1, 1, LGFFM, [128]] # 0-P2/4 (替代原始的 Conv [64, 6, 2, 2] + Conv [128, 3, 2])
  
  - [-1, 3, C3, [128]]  # 1
  - [-1, 1, Conv, [256, 3, 2]] # 2-P3/8
  - [-1, 6, C3, [256]]  # 3
  - [-1, 1, Conv, [512, 3, 2]] # 4-P4/16
  - [-1, 9, C3, [512]]  # 5
  - [-1, 1, Conv, [1024, 3, 2]] # 6-P5/32
  - [-1, 3, C3, [1024]] # 7
  - [-1, 1, SPPF, [1024, 5]] # 8

# YOLOv5 head (保持原始结构)
head:
  - [-1, 1, Conv, [512, 1, 1]]
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 5], 1, Concat, [1]] # cat backbone P4
  - [-1, 3, C3, [512, False]] # 12

  - [-1, 1, Conv, [256, 1, 1]]
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 3], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, C3, [256, False]] # 16 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]] # cat head P4
  - [-1, 3, C3, [512, False]] # 19 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]] # cat head P5
  - [-1, 3, C3, [1024, False]] # 22 (P5/32-large)

  - [[16, 19, 22], 1, Detect, [nc]] # Detect(P3, P4, P5)
