# Ultralytics YOLOv5-CMS object detection model
# Replaces deeper layers with shallower ones and adds MACF/CAM modules.

# Parameters
nc: 80 # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.25  # layer channel multiple
anchors:
  - [5,6, 8,14, 15,11]  # P2/4
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16

# YOLOv5 v6.0 backbone (Unchanged)
backbone:
  # [from, number, module, args]
  - [-1, 1, Conv, [64, 6, 2, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C3, [128]] # 2-P2/4 (128ch)
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C3, [256]] # 4-P3/8 (256ch)
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 9, C3, [512]] # 6-P4/16 (512ch)
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C3, [1024]] # 8-P5/32
  - [-1, 1, SPPF, [1024, 5]] # 9

# YOLOv5-CMS head
head:
  # P5 -> P4
  - [-1, 1, Conv, [512, 1, 1]] # 10
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 11
  - [[-1, 6], 1, MACF, [512]] # 12 (Fuse with P4)
  - [-1, 3, C3, [512, False]] # 13 (P4 Fused)

  # P4 -> P3
  - [-1, 1, Conv, [256, 1, 1]] # 14
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 15
  - [[-1, 4], 1, MACF, [256]] # 16 (Fuse with P3)
  - [-1, 3, C3, [256, False]] # 17 (P3 Fused)

  # P3 -> P2 (New scale)
  - [-1, 1, Conv, [128, 1, 1]] # 18 (Reduce to 128)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 19
  - [[-1, 2], 1, MACF, [128]] # 20 (Fuse with P2)
  - [-1, 3, C3, [128, False]] # 21 (P2 Fused)
  
  # CAM on P2 (Small Object Focus)
  - [-1, 1, CAM, [128]] # 2

  # PAN Bottom-Up
  # P2 -> P3
  - [21, 1, Conv, [256, 3, 2]] # 23 (Stride 2 up to P3 dim). Input from 21 (Pre-CAM P2)
  - [[-1, 17], 1, MACF, [256]] # 24 (Fuse with P3 T-D)
  - [-1, 3, C3, [256, False]] # 25 (P3 Out)

  # P3 -> P4
  - [-1, 1, Conv, [512, 3, 2]] # 26 (Stride 2 up to P4 dim)
  - [[-1, 13], 1, MACF, [512]] # 27 (Fuse with P4 T-D)
  - [-1, 3, C3, [512, False]] # 28 (P4 Out)

  - [[22, 25, 28], 1, Detect, [nc]] # 29
