# Ultralytics YOLO12-P2 (Experimental)
# Based on YOLO12
# ADDED: P2 Head (Stride 4)
# NOTE: Uses C3k2 for P2 head block to match backbone low-level style

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo12n.yaml' will call yolo12.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 272 layers, 2,602,288 parameters, 2,602,272 gradients, 6.7 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 272 layers, 9,284,096 parameters, 9,284,080 gradients, 21.7 GFLOPs
  m: [0.50, 1.00, 512] # summary: 292 layers, 20,199,168 parameters, 20,199,152 gradients, 68.1 GFLOPs
  l: [1.00, 1.00, 512] # summary: 488 layers, 26,450,784 parameters, 26,450,768 gradients, 89.7 GFLOPs
  x: [1.00, 1.50, 512] # summary: 488 layers, 59,210,784 parameters, 59,210,768 gradients, 200.3 GFLOPs

# YOLO12n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] # 2
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 4
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 4, A2C2f, [512, True, 4]] # 6
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]] # 8

# YOLO12n head
head:
  # P5 -> P4
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 9
  - [[-1, 6], 1, Concat, [1]] # 10 cat backbone P4
  - [-1, 2, A2C2f, [512, False, -1]] # 11 (P4/16)

  # P4 -> P3
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 12
  - [[-1, 4], 1, Concat, [1]] # 13 cat backbone P3
  - [-1, 2, A2C2f, [256, False, -1]] # 14 (P3/8)

  # P3 -> P2 (New P2 Head Path)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 15
  - [[-1, 2], 1, Concat, [1]] # 16 cat backbone P2
  - [-1, 2, C3k2, [128, False]] # 17 (P2/4) - Using C3k2 consistent with backbone

  # P2 -> P3
  - [-1, 1, Conv, [128, 3, 2]] # 18
  - [[-1, 14], 1, Concat, [1]] # 19 cat head P3
  - [-1, 2, A2C2f, [256, False, -1]] # 20 (P3/8)

  # P3 -> P4
  - [-1, 1, Conv, [256, 3, 2]] # 21
  - [[-1, 11], 1, Concat, [1]] # 22 cat head P4
  - [-1, 2, A2C2f, [512, False, -1]] # 23 (P4/16)

  # P4 -> P5
  - [-1, 1, Conv, [512, 3, 2]] # 24
  - [[-1, 8], 1, Concat, [1]] # 25 cat head P5
  - [-1, 2, C3k2, [1024, True]] # 26 (P5/32)

  # Detect
  - [[17, 20, 23, 26], 1, Detect, [nc]] # Detect(P2, P3, P4, P5)
